# CannotAcquireCoordinatesFromLinkWithScaledLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SharedCoordinatesFailures..::..CannotAcquireCoordinatesFromLinkWithScaledLocation Property
BuiltInFailures..::..SharedCoordinatesFailures Class See Also
---
Can't acquire coordiantes from a link that has a scaled location.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAcquireCoordinatesFromLinkWithScaledLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAcquireCoordinatesFromLinkWithScaledLocation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAcquireCoordinatesFromLinkWithScaledLocation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace